app/controllers/exercises_controller.rb

  def create
    @exercise = Exercise.new(exercise_params)
    @exercise.user_id = 1
    if @exercise.save
---
INSERT INTO "exercises" ("user_id", "exercise_type", "suggested_emotion", "valence", "arousal", "video_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["exercise_type", "pme"], ["suggested_emotion", "lolol"], ["valence", 0], ["arousal", 200], ["video_id", 3]]