app/controllers/surveys_controller.rb

  def create
    @survey = Survey.new(survey_params)
    @survey.user = current_user
    if @survey.save
---
INSERT INTO "surveys" ("user_id", "points", "feedback") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["points", 4], ["feedback", "asdasfasf"]]